# SetRenderingImageExposureSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..SetRenderingImageExposureSettings Method
RenderingSettings Class See Also
---
Changes the rendering image exposure settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetRenderingImageExposureSettings(
	RenderingImageExposureSettings exposure
)
```

Visual Basic
---
```text
Public Sub SetRenderingImageExposureSettings ( _
	exposure As RenderingImageExposureSettings _
)
```

Visual C++
---
```text
public:
void SetRenderingImageExposureSettings(
	RenderingImageExposureSettings^ exposure
)
```

# ### Parameters
exposure
    Type: Autodesk.Revit.DB..::..RenderingImageExposureSettings An instance of the new rendering image exposure settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace